Autodesk.Revit.DB.DefinitionGroups.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.DefinitionGroups.GetEnumerator
Retrieves an enumerator to the collection.
Returns: The enumerator.

Autodesk.Revit.DB.DefinitionGroups.Size
The number of definition groups in the collection.

Autodesk.Revit.DB.DefinitionGroups.IsEmpty
Identifies if the definition groups collection is empty.

Autodesk.Revit.DB.DefinitionGroups.Contains(Autodesk.Revit.DB.DefinitionGroup)
Tests for the existence of a definition group within the collection.
Returns: True if the definition group was found, false otherwise.
definitionGroup: The definition group to look for.

Autodesk.Revit.DB.DefinitionGroups.Create(System.String)
Create a new parameter definition group using the name provided.
name: The name of the group to be created.
Returns: If successful a reference to the new parameter group is returned, otherwise null.
Remarks: If a group with the same name already exists then an exception will be thrown.

Autodesk.Revit.DB.DefinitionGroups.Item(System.String)
Retrieve a definition group by name.
groupName: The name of the group for which to search.
Remarks: If the group is not found then null will be returned.

Autodesk.Revit.DB.DefinitionGroups
A specialized set of definition groups that allows creation of new groups.